Конфигурация/src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <registerRecords>AccumulationRegister.ДоставкиИОплаты</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллыКлиентов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.Велосипеды</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БаллыНаСписание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПозицииПродажи</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПозиции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Enums/ВидНоменклатуры/ВидНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

Конфигурация/src/Documents/ОплатаЗаказа/ОплатаЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаЗаказа</name>
  <registerRecords>AccumulationRegister.ДоставкиИОплаты</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Конфигурация/src/Documents/Заказ/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура заполняет табличный документ для печати.
//
// Параметры:
//	ТабДок - ТабличныйДокумент - табличный документ для заполнения и печати.
//	Ссылка - Произвольный - содержит ссылку на объект, для которого вызвана команда печати.
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Заказ.Номер КАК Номер,
		|	Заказ.Дата КАК Дата,
		|	Заказ.Клиент КАК Клиент,
		|	Заказ.Курьер КАК Курьер,
		|	Заказ.Транспорт КАК Транспорт,
		|	Заказ.Транспорт.СерийныйНомер КАК ТранспортСерийныйНомер,
		|	Заказ.Цена КАК Цена,
		|	Заказ.БаллыНаСписание КАК БаллыНаСписание,
		|	Заказ.СуммаЗаказа КАК СуммаЗаказа
		|ИЗ
		|	Документ.Заказ КАК Заказ
		|ГДЕ
		|	Заказ.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПозицииПродажиШапка = Макет.ПолучитьОбласть("ПозицииПродажиШапка");
	ОбластьПозицииПродажи = Макет.ПолучитьОбласть("ПозицииПродажи");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	
	Если Выборка.Следующий() Тогда
		
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПараметрыОбластиЗаголовка = Новый Структура;
		ПараметрыОбластиЗаголовка.Вставить("Номер", ОбщиеФункцииКлиентСервер.УдалитьНулиСлева(Выборка.Номер));
		ПараметрыОбластиЗаголовка.Вставить("Дата", Формат(Выборка.Дата, "ДЛФ=D;"));
		
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыОбластиЗаголовка);

		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ТабДок.Вывести(ОбластьПозицииПродажиШапка);
		
		ЗапросПозицииПродажи = Новый Запрос;
		ЗапросПозицииПродажи.Текст =
			"ВЫБРАТЬ
			|	ЗаказПозицииПродажи.Ссылка КАК Ссылка,
			|	ЗаказПозицииПродажи.НомерСтроки КАК НомерСтроки,
			|	ЗаказПозицииПродажи.Товар КАК Товар,
			|	ЗаказПозицииПродажи.ЦенаЗаЕдиницу КАК ЦенаЗаЕдиницу,
			|	ЗаказПозицииПродажи.Количество КАК Количество,
			|	ЗаказПозицииПродажи.СуммаПозиции КАК СуммаПозиции
			|ИЗ
			|	Документ.Заказ.ПозицииПродажи КАК ЗаказПозицииПродажи
			|ГДЕ
			|	ЗаказПозицииПродажи.Ссылка В (&Ссылка)";
		ЗапросПозицииПродажи.Параметры.Вставить("Ссылка", Ссылка);
		
		ВыборкаПозицииПродажи = ЗапросПозицииПродажи.Выполнить().Выбрать();
		
		Пока ВыборкаПозицииПродажи.Следующий() Цикл
			
			ОбластьПозицииПродажи.Параметры.Заполнить(ВыборкаПозицииПродажи);
			ТабДок.Вывести(ОбластьПозицииПродажи, ВыборкаПозицииПродажи.Уровень());
			
		КонецЦикла;
		
		ВставлятьРазделительСтраниц = Истина;
		
	КонецЕсли;

КонецПроцедуры

// Провести документы с бесценными товарами.
Процедура ПровестиДокументыСБесценнымиТоварами() Экспорт
	
	ЗапросЗаказы = Новый Запрос;
	ЗапросЗаказы.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Заказ.Номер КАК Номер,
		|	Заказ.Ссылка КАК Ссылка,
		|	Заказ.Проведен КАК Проведен
		|ИЗ
		|	Документ.Заказ КАК Заказ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заказ.ПозицииПродажи КАК ЗаказПозицииПродажи
		|		ПО Заказ.Ссылка = ЗаказПозицииПродажи.Ссылка
		|ГДЕ
		|	ЗаказПозицииПродажи.СуммаПозиции = 0
		|	И ЗаказПозицииПродажи.Товар.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидНоменклатуры.Товар)";
		
	РезультатЗаказы = ЗапросЗаказы.Выполнить();

	Если Не РезультатЗаказы.Пустой() Тогда
		
		ВыборкаЗаказы = РезультатЗаказы.Выбрать();

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Найдено %1 заказов с бесценными товарами:", ВыборкаЗаказы.Количество());
		Сообщение.Сообщить();
		
		Пока ВыборкаЗаказы.Следующий() Цикл
			
			Объект = ВыборкаЗаказы.Ссылка.ПолучитьОбъект();
			ПояснениеДляПользователя = ?(ВыборкаЗаказы.Проведен, "Перепроведён", "Проведён впервые");
			
			Объект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("%1 - %2", ВыборкаЗаказы.Номер, ПояснениеДляПользователя);
			Сообщение.Сообщить();

		КонецЦикла;
		
	КонецЕсли;
	
	ЗапросОплаты = Новый Запрос;
	
//	Вариант с оператором "В"
//	ЗапросОплаты.Текст = 
//		"ВЫБРАТЬ
//		|	ОплатаЗаказаДокумент.Номер КАК Номер,
//		|	ОплатаЗаказаДокумент.Ссылка КАК Ссылка,
//		|	ОплатаЗаказаДокумент.Проведен КАК Проведен
//		|ИЗ
//		|	Документ.ОплатаЗаказа КАК ОплатаЗаказаДокумент
//		|ГДЕ
//		|	ОплатаЗаказаДокумент.Заказ В
//		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|			ЗаказПозицииПродажи.Ссылка КАК Ссылка
//		|		ИЗ
//		|			Документ.Заказ.ПозицииПродажи КАК ЗаказПозицииПродажи
//		|		ГДЕ
//		|			ЗаказПозицииПродажи.СуммаПозиции = 0
//		|			И ЗаказПозицииПродажи.Товар.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидНоменклатуры.Товар))";

	ЗапросОплаты.Текст =
		"ВЫБРАТЬ
		|	ОплатаЗаказаДокумент.Номер КАК Номер,
		|	ОплатаЗаказаДокумент.Ссылка КАК Ссылка,
		|	ОплатаЗаказаДокумент.Проведен КАК Проведен
		|ИЗ
		|	Документ.ОплатаЗаказа КАК ОплатаЗаказаДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заказ.ПозицииПродажи КАК ЗаказПозицииПродажи
		|		ПО ОплатаЗаказаДокумент.Заказ = ЗаказПозицииПродажи.Ссылка
		|ГДЕ
		|	ЗаказПозицииПродажи.СуммаПозиции = 0
		|	И ЗаказПозицииПродажи.Товар.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидНоменклатуры.Товар)";
		
	РезультатОплаты = ЗапросОплаты.Выполнить();

	Если Не РезультатОплаты.Пустой() Тогда
		
		ВыборкаОплаты = РезультатОплаты.Выбрать();

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Найдено %1 оплат заказов с бесценными товарами:", ВыборкаОплаты.Количество());
		Сообщение.Сообщить();
		
		Пока ВыборкаОплаты.Следующий() Цикл
			
			Объект = ВыборкаОплаты.Ссылка.ПолучитьОбъект();
			ПояснениеДляПользователя = ?(ВыборкаОплаты.Проведен, "Перепроведён", "Проведён впервые");
			
			Объект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("%1 - %2", ВыборкаОплаты.Номер, ПояснениеДляПользователя);
			Сообщение.Сообщить();

		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//#Область СлужебныеПроцедурыИФункции
//
//#КонецОбласти

//#Область ОбработчикиСобытий
//
//// Код процедур и функций
//
//#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//// Код процедур и функций
//
//#КонецОбласти

#КонецЕсли
